---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.Camera.Dispose
source: html/dbf01f3b-636f-e168-8898-e81baeb004e5.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.Dispose Method

Releases all resources used by the Camera

## Syntax (C#)
```csharp
public void Dispose()
```